export const PUPPY_MESSAGES = {
  default: `주인님! ${'\n'} 제가 금주는 도와드려도 ${'\n'} 해야할 일을 도와드릴 순 없어요..`,
  archiveSuccess: `음주 기록 완료! ${'\n'} 오늘도 기록해 주셨네요 :) ${'\n'} 잘 하셨어요!`,
  archiveToday: `주인님! ${'\n'} 오늘 기록을 도와드릴게요! ${'\n'} 오늘은 술을 드셨나요?`,
  archiveYesterday: `주인님! ${'\n'} 어제 기록을 도와드릴게요! ${'\n'} 어제는 술을 드셨나요?`,
  makeGoal: `이번 달에 지키고 싶은 ${'\n'} 목표를 선택해주세요! ${'\n'} 어떤 목표를 세우실 거에요?`,
  makeNewGoal: `이번 달에 지키고 싶은 ${'\n'} 새로운 목표를 알려주세요! ${'\n'} 오늘부터 30일 동안 지킬 거에요!`,
  namingPuppy: `주인님! ${'\n'} 드디어 제게도 ${'\n'} 이름이 생기나 보네요...`,
  namingUser: `주인님! ${'\n'} 앞으로는 어떻게 불러드릴까요? ${'\n'} 너무 길지 않게 부탁해요.`,
};

export const SUCCESS_MESSAGES = {};

export const ERROR_MESSAGES = {};

// 설정 페이지
export const POLICY_MESSAGES = {
  /** 이용약관 */
  terms_of_uses:
    '① 회원의 개인정보는 공공기관의 개인정보보호법에 의해 보호되며 당 사이트의 개인정보처리방침이 적용됩니다. ② 당 사이트의 회원 정보는 다음과 같이 수집, 사용, 관리, 보호됩니다. 1. 개인정보의 수집 : 당 사이트는 회원 가입시 회원이 제공하는 정보를 수집합니다. 2. 개인정보의 사용 : 당 사이트는 서비스 제공과 관련해서 수집된 회원정보를 본인의 승낙 없이 제3자에게 누설, 배포하지 않습니다.',
  /** 개인정보 처리방침 */
  privacy_policies:
    '① 회원의 개인정보는 공공기관의 개인정보보호법에 의해 보호되며 당 사이트의 개인정보처리방침이 적용됩니다. ② 당 사이트의 회원 정보는 다음과 같이 수집, 사용, 관리, 보호됩니다. 1. 개인정보의 수집 : 당 사이트는 회원 가입시 회원이 제공하는 정보를 수집합니다. 2. 개인정보의 사용 : 당 사이트는 서비스 제공과 관련해서 수집된 회원정보를 본인의 승낙 없이 제3자에게 누설, 배포하지 않습니다.',
};
